---
title: CurtainSystem
classe: Autodesk.Revit.DB.CurtainSystem
namespace: Autodesk.Revit.DB
eredita: Autodesk.Revit.DB.CurtainSystemBase
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 4
---

# CurtainSystem

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `CurtainGridSet CurtainGrids { get; }` | `curtainSystem.CurtainGrids` | CurtainGridSet |
| `CurtainSystemType CurtainSystemType { get; set; }` | `curtainSystem.CurtainSystemType` | CurtainSystemType |
| `Void AddCurtainGrid(Reference)` | `curtainSystem.AddCurtainGrid(face)` | Void |
| `Void RemoveCurtainGrid(Reference)` | `curtainSystem.RemoveCurtainGrid(face)` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```